app/views/admin/comments/index.haml

        %td
          = "#{comment.user.first_name} #{comment.user.last_name}"
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]