app/controllers/admin/volunteer_requests_controller.rb

SELECT "volunteer_hours".* FROM "volunteer_hours"
---
  def index
    @volunteer_requests = VolunteerHour.all