app/controllers/admin/volunteers_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @volunteers = User.all