app/views/admin/volunteer_requests/index.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        %td
          = "#{volunteer_request.user.first_name} #{volunteer_request.user.last_name}"