app/views/events/index.haml

		= simple_form_for(@events_filter, url: events_path, method: :get) do |f|
			= f.input :region, as: :select, collection: @regions, prompt: 'Select a Region', selected: (params[:events_filter].present? ? params[:events_filter][:region] : nil), input_html: {"data-remote" => true, onchange: "this.form.submit();"}
---
SELECT "regions".* FROM "regions"

		%p.helper-text
			= "No events found in #{Region.find(params[:events_filter][:region]).name}."
---
SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]