app/views/events/show.haml

SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = $1  [["event_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  .cell.large-8.medium-8
    - @event.comments.each do |comment|
      .cell
        %span
          = "#{comment.user.first_name} #{comment.user.last_name}"
      .cell