app/controllers/comments_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Lorem ipsum"], ["user_id", 1], ["event_id", 1], ["created_at", "2019-09-15 15:37:22.952350"], ["updated_at", "2019-09-15 15:37:22.952350"]]
---
  def create
    event = Event.find(params[:event_id])
    current_user.comments.create(comment_params.merge(event_id: event.id))