app/controllers/events_controller.rb

SELECT "regions".* FROM "regions"
SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."region_id" = $1  [["region_id", 1]]
SELECT "events".* FROM "events"
---
  def index
    @regions = Region.all
    @events_filter = EventsFilter.new(events_filter_params)
    if @events_filter.region.present?
      @events = Event.where(region_id: @events_filter.region)
    else
      @events = Event.all

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "volunteer_hours".* FROM "volunteer_hours" WHERE "volunteer_hours"."user_id" = $1 ORDER BY "volunteer_hours"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def show
    @event = Event.find(params[:id])
    @event_volunteer_hour = current_user.volunteer_hours.first