app/controllers/volunteer_hours_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "volunteer_hours" ("time_worked", "user_id", "event_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["time_worked", 120], ["user_id", 1], ["event_id", 1], ["created_at", "2019-09-15 15:37:10.184310"], ["updated_at", "2019-09-15 15:37:10.184310"], ["status", 0]]
---
  def create
    event = Event.find(params[:event_id])
    current_user.volunteer_hours.create(volunteer_hour_params.merge(event_id: event.id, status: 'requested'))